Ran Plan for 3 projects:

1. dir: `resources/aws/staging` workspace: `default`
1. dir: `resources/aws/staging/vpc/vpc-percobaan` workspace: `default`
1. dir: `resources/aws/staging/vpc/vpc-percobaan2` workspace: `default`

### 1. dir: `resources/aws/staging` workspace: `default`
**Plan Error**
```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging": 
time=2023-05-26T10:08:00Z level=error msg=Did not find any Terraform files (*.tf) in /root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging
time=2023-05-26T10:08:00Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `resources/aws/staging/vpc/vpc-percobaan` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "4.51.0"...
- Installing hashicorp/aws v4.51.0...
- Installed hashicorp/aws v4.51.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.main will be created
  + resource "aws_subnet" "main" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-vpc-percobaan"
        }
      + tags_all                                       = {
          + "Name" = "subnet-vpc-percobaan"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc-percobaan"
        }
      + tags_all                             = {
          + "Name" = "vpc-percobaan"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc-id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging/vpc/vpc-percobaan/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging/vpc/vpc-percobaan/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d resources/aws/staging/vpc/vpc-percobaan`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.126.77.33/lock?id=rudikarangloi%252FTerraform-studidevops%252Fresources%252Faws%252Fstaging%252Fvpc%252Fvpc-percobaan%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d resources/aws/staging/vpc/vpc-percobaan`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `resources/aws/staging/vpc/vpc-percobaan2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "4.51.0"...
- Installing hashicorp/aws v4.51.0...
- Installed hashicorp/aws v4.51.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.main will be created
  + resource "aws_subnet" "main" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-vpc-percobaan2"
        }
      + tags_all                                       = {
          + "Name" = "subnet-vpc-percobaan2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc-percobaan2"
        }
      + tags_all                             = {
          + "Name" = "vpc-percobaan2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc-id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging/vpc/vpc-percobaan2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/1/default/resources/aws/staging/vpc/vpc-percobaan2/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d resources/aws/staging/vpc/vpc-percobaan2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.126.77.33/lock?id=rudikarangloi%252FTerraform-studidevops%252Fresources%252Faws%252Fstaging%252Fvpc%252Fvpc-percobaan2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d resources/aws/staging/vpc/vpc-percobaan2`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`